Show / Hide Table of Contents
Class ColumnDataEc2
Column data Ec2
Inheritance
System.Object
ColumnData
ColumnDataEc2
Inherited Members
 ColumnData.ImperfectionsInput
 ColumnData.SecondOrderEffectInput
 ColumnData.CalculateY
 ColumnData.CalculateZ
 ColumnData.L
 ColumnData.EffectiveLength
 ColumnData.L0Y
 ColumnData.L0Z
 ColumnData.FemLenghtFromFlexibleSupport
 ColumnData.FemL0Y
 ColumnData.FemL0Z
 ColumnData.SupportTopY
 ColumnData.SupportTopZ
 ColumnData.SupportBottomY
 ColumnData.SupportBottomZ
 ColumnData.ImperfectionDirection
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ColumnDataEc2 : ColumnData
Constructors
Improve this Doc   View Source
ColumnDataEc2()
Constructor
Declaration
public ColumnDataEc2()
Properties
Improve this Doc   View Source
BracedY
Braced structure Y-Y
Declaration
public bool BracedY { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
BracedZ
Braced structure Z-Z
Declaration
public bool BracedZ { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Calculation2ndOrderEffect
Use calculation of 2nd order effect
Declaration
public bool Calculation2ndOrderEffect { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
EffectConsidered
Effect considered
Declaration
public EffectConsideredType EffectConsidered { get; set; }
Property Value
 Type |  Description
 EffectConsideredType
Improve this Doc   View Source
GeometricImperfectionsSLS
Use calculation geometric imperfections for SLS
Declaration
public bool GeometricImperfectionsSLS { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
GeometricImperfectionsULS
Use calculation geometric imperfections for ULS
Declaration
public bool GeometricImperfectionsULS { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
NumberOfVerticalMembersY
Gets or sets the number of vertical member in Y direction.
Declaration
public int NumberOfVerticalMembersY { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
NumberOfVerticalMembersZ
Gets or sets the number of vertical member in Z direction.
Declaration
public int NumberOfVerticalMembersZ { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
SecondOrderEffectMethod
Type of calculation method of 2nd order effect
Declaration
public SecondOrderEffectMethodEc2 SecondOrderEffectMethod { get; set; }
Property Value
 Type |  Description
 SecondOrderEffectMethodEc2
Improve this Doc   View Source
TotalL
Gets or sets the total length of building
Declaration
public double TotalL { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UserValuec0Y
c0 user value - for nominal stiffness
Declaration
public double UserValuec0Y { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UserValuec0Z
c0 user value - for nominal stiffness
Declaration
public double UserValuec0Z { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UserValuecY
c user value - for nominal stiffness
Declaration
public double UserValuecY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
UserValuecZ
c user value - for nominal stiffness
Declaration
public double UserValuecZ { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ValueTypeOfc0Y
Type of c0 value
Declaration
public ValueTypec0 ValueTypeOfc0Y { get; set; }
Property Value
 Type |  Description
 ValueTypec0
Improve this Doc   View Source
ValueTypeOfc0Z
Type of c0 value
Declaration
public ValueTypec0 ValueTypeOfc0Z { get; set; }
Property Value
 Type |  Description
 ValueTypec0
Improve this Doc   View Source
ValueTypeOfcY
Type of c value - for nominal curvature
Declaration
public ValueTypec ValueTypeOfcY { get; set; }
Property Value
 Type |  Description
 ValueTypec
Improve this Doc   View Source
ValueTypeOfcZ
Type of c value - for nominal curvature
Declaration
public ValueTypec ValueTypeOfcZ { get; set; }
Property Value
 Type |  Description
 ValueTypec
 Improve this Doc
 View Source